Repository: nanogiants/ba-playground-app-kmp
Catalog: ios/Playground/Resources/*.lproj/Localizable.strings
Languages: de

# about_title
source: About
de: Über uns

# comparison_title
source: Comparison
de: Vergleich

# usecases_title
source: Use Cases
de: Anwendung

# nasa_title
source: Web
de: Nasa

# fibonacci_title
source: Multithreading
de: Fibonacci

# notes_title
source: Database
de: Notizen

# pixelsort_title
source: Medien und Hardware
de: Pixelsort

# settings_title
source: Key-Value Storage
de: Settings

# compare_explanation
source: Anteil an Code, der in Kotlin Multiplatform zwischen Android und iOS geteilt wird.
de: Anteil an Codezeilen in %, die Kotlin Multiplatform gegenüber der nativen Entwicklung einsparen kann.

# compare_title_average
source: Average
de: Mittelwert

# compare_average
source: All use-cases
de: Alle Use-Cases

# about_faq_a1
source: Die App ermöglicht das Ausprobieren verschiedener Use-Cases.
de: Die App ermöglicht es Nutzern, verschiedene Use-Cases auszuprobieren.

# about_faq_a2
source: Ein Use-Case (engl. Anwendungsfall) repräsentiert eine Funktion, die typischerweise in mobilen Anwendungen enthalten ist. Beispiele sind das Verwenden der Kamera, das persistente Speichern von Daten oder das Laden von Inhalten mittels HTTP.
de: Ein Use-Case (engl. Anwendungsfall) repräsentiert eine Funktion, die typischerweise in Apps enthalten ist. Beispiele sind das verwenden der Kamera, das persistente Speichern von Daten oder das Laden von Inhalten mittels HTTP.

# about_faq_a3
source: Es wurden Apps von der Firma appcom interactive sowie beliebte Anwendungen aus App Store und Play Store analysiert.
de: Es wurden Apps von der Firma appcom interactive, sowie beliebte Anwendungen aus den Charts im Apple AppStore und Google PlayStore betrachtet.

# about_faq_a4
source: Die App dient als Grundlage, anhand der die Technologie Kotlin Multiplatform untersucht und mit der nativen Entwicklung verglichen wird. Die Strukturierung in Use-Cases ermöglicht es, unterschiedliche Funktionen und Aspekte der Entwicklung innerhalb einer einzigen Anwendung zu Testen.
de: Die App dient als Grundlage, anhand der die Technologie Kotlin Multiplatform untersucht und mit der nativen Entwicklung verglichen wird. Die Strukturierung in Use-Cases ermöglicht es, unterschiedliche Aspekte der Entwicklung, Funktionen oder Technologien innerhalb einer Anwendung auszuprobieren.

# settings_explanation
source: Enter a text in the textfield below. It is stored in the key value storage of the device.
de: Gib einen Text in das Textfeld ein. Dieser wird persistent im key-value Speicher des Geräts gespeichert.

# settings_placeholder
source: Your text
de: Dein Text

# fibonacci_explanation
source: Calculation of the nth number of the fibonacci sequence. Please enter a number between 0 and 35.
de: Berechnung der n-ten Zahl der Fibonacci Folge. Als Eingabe sind Zahlen zwischen 0 und 35 zugelassen.

# fibonacci_error
source: The number should be between 0 and 35.
de: Die Eingabe muss zwischen 0 und 35 sein.

# pixelsort_explanation
source: Choose a picture
de: Wähle ein Bild aus

# pixelsort_error
source: Something went wrong
de: Es ist ein Fehler aufgetreten

# notes_hint_content
source: content
de: Inhalt

# notes_title_add
source: Add note
de: Notiz hinzufügen

# notes_add
source: add
de: hinzufügen

# path_not_found_error
source: The file '%@' could not be found.
de: Pfad nicht gefunden

# network_unavailable_error
source: The network is currently unavailable.
de: Netzwork nicht verfügbar

# test
source: entest
de: detest
